import { Component } from '@angular/core';

@Component({
  selector: 'app-introduction-page',
  templateUrl: './introduction-page.component.html',
  styleUrls: ['./introduction-page.component.css']
})
export class IntroductionPageComponent {
  label = "Вступ";
  text = ["Дослідження лексем, що є засобами діагностики суспільства під час широкомасштабної фази російсько-української війни, як мовного явища та засобу відображення змін у суспільних настроях є надзвичайно актуальним для лінгвістів. Новизна матеріалу зумовлює невелику кількість досліджень воєнних неологізмів та загальновживаної лексики з додатковими конотативними значеннями в соціолінгвістичному аспекті. Незважаючи на велику кількість джерел, які описали денотативну складову воєнних неологізмів, використання конотативного значення лексем для аналізу соціо-політичних поглядів мовців залишається незвіданим.",
    "Цей словник має на меті систематизувати знайдені  нами воєнні неологізми та номінативні одинці, які набули конотативної семантики внаслідок повномасштабного вторгнення. Словник містить більше 200 номінативних одиниць, їхні семеми, конотативні семи та приклади використання, які були вилученні з різноманітних джерел. Завдяки цій розробці можна прослідкувати за змінами у лексиці українського суспільства та побачити як екстралінгвістичні чинники вплинули на мову."
  ]
}
